/*
zad1
Да се състави програма, която се прочита цяло число до 1000 и се представя като число в
двоична бройна система.
Програмата, чрез масив, да изчислява последователно всички цифри на въведеното
естествено число в 2-ична бройна система.
*/
#include <stdio.h>
#include <stdlib.h>

int main()
{
    system("chcp 65001>nul");
    int mas[10],n,i;
    printf("Въведете число: ");
    scanf("%d",&n);
    while(n>1000){
        printf("Въведете число: ");
        scanf("%d",&n);
    }
    for(i=0; n>0; i++){
        mas[i]=n%2;
        n=n/2;
    }
    printf("Вашето число в двоична бройна система е: ");
    for(i=i-1; i>=0; i--){
        printf("%d",mas[i]);
    }
    return 0;
}
